import pandas as pd

df1 = pd.DataFrame({'name':['마징가',"베트맨","원더우먼"],
                    'kor':[87,91,69],
                    'eng':[99,73,89],
                    'sci':[71,95,62]})

df2 = ([11,22,33,44,55],[66,77,88,99,10],[66,77,88,99,100])
print(df1,end="\n\n")
print(f'{pd.DataFrame(df2)}',end="\n\n")

df3 = ((11,22,33,44,55,),(66,77,88,99,10,),(66,77,88,99,100,))
print(pd.DataFrame(df3))


#1 데이터를 입력할 때, 리스트는 행으로 순서대로 입력되는 반면
#2 딕셔너리는 열로 들어가는 이유는 무엇인가?
#3 출력할때 좀 맞춰서 나오게 할 수 없나?

n=1
print(f'{n:<+5}')